public class java_kiso_1 {
	public static void main(String arg[]) {

//	問4.	変数 num に小数 4.5 を代入し、その値を半分にして表示するプログラムを作成してください。			
		double num4 = 4.5;
		System.out.println("問4：" + num4 / 2);
		
//	問5.	変数 num に小数 7.8 を代入し、その値を整数部分と小数部分に分けて表示するプログラムを作成してください。									
		double num5 = 7.8;
		System.out.println("問5 : 整数は" + (int)num5 + "少数は" + (num5-7.0));
		
//	問6.	変数 num に小数 3.2 を代入し、その値を10倍にして表示するプログラムを作成してください。									
		double num6 = 3.2;
		System.out.println("問6：3.2の10倍は" +num6*10);
//	問7.	変数 num に整数 0 を代入し、その値が0かどうかを判定するプログラムを作成してください。									
		int num7 = 0;
		if (num7 == 0) {
			
		}
//	問8.	変数 num に整数 -5 を代入し、その値が負の数かどうかを判定するプログラムを作成してください。									
		
//	問9.	変数 num に整数 15 を代入し、その値が5の倍数かどうかを判定するプログラムを作成してください。									
		
//	問10.	変数 num1 に整数 8 を、num2 に整数 3 を代入し、それらの和を計算して表示するプログラムを作成してください。									
		
//	問11.	変数 num1 に整数 10 を、num2 に整数 4 を代入し、それらの差を計算して表示するプログラムを作成してください
		
//	問12.	変数 num1 に整数 6 を、num2 に整数 7 を代入し、それらの積を計算して表示するプログラムを作成してください。									

	}
}